namespace Domain;

public class DailyAdventureProvider
{
    private readonly IReadOnlyDictionary<(int Month, int Day), Adventure> _adventures;

    public DailyAdventureProvider()
    {
        var adventures = new Dictionary<(int Month, int Day), Adventure>
        {
            {
                (12, 10),
                new Adventure(
                    new DateTimeOffset(2025, 12, 10, 0, 0, 0, TimeSpan.Zero),
                    "🎯 Задание на сегодня",
                    $"Бодро начинаем!🔥{Environment.NewLine}Задача сегодня не простая.{Environment.NewLine}Снеговик без снега нужен.☃️"
                )
            },
            {
                (12, 11),
                new Adventure(
                    new DateTimeOffset(2025, 12, 11, 0, 0, 0, TimeSpan.Zero),
                    "✨ Твое приключение",
                    "Поделись своей историей самой запоминающейся ёлки в детстве.🎄 Прям пиши сообщение. Можно кратко:) Ну и фоточки приложи, если есть)"
                )
            },
            {
                (12, 12),
                new Adventure(
                    new DateTimeOffset(2025, 12, 12, 0, 0, 0, TimeSpan.Zero),
                    "🎄 Новогоднее задание",
                    "Сложнее задание сегодня. С командой повторите стоп-кадр из любого новогоднего фильма.📺"
                )
            },
            {
                (12, 13),
                new Adventure(
                    new DateTimeOffset(2025, 12, 13, 0, 0, 0, TimeSpan.Zero),
                    "🌟 Сегодняшний квест",
                    "13 декабря кидаем любимый новогодний мем, если имеется!😺"
                )
            },
            {
                (12, 14),
                new Adventure(
                    new DateTimeOffset(2025, 12, 14, 0, 0, 0, TimeSpan.Zero),
                    "🎁 Задание дня",
                    "Воскресенье сегодня! Никаких заданий не выполняем) просто отдых!😴"
                )
            },
            {
                (12, 15),
                new Adventure(
                    new DateTimeOffset(2025, 12, 15, 0, 0, 0, TimeSpan.Zero),
                    "❄️ Зимнее приключение",
                    "Сегодня дресс-код! Надеваем приколдесные носки.🦖"
                )
            },
            {
                (12, 16),
                new Adventure(
                    new DateTimeOffset(2025, 12, 16, 0, 0, 0, TimeSpan.Zero),
                    "🎊 Твоя миссия",
                    "Фото с новогоднего утренника у всех есть?🐰 Делимся."
                )
            },
            {
                (12, 17),
                new Adventure(
                    new DateTimeOffset(2025, 12, 17, 0, 0, 0, TimeSpan.Zero),
                    "🎈 Задание для тебя",
                    "Письмо Деду Морозу давно не писали.🎅 В чат отправляй фото конверта с письмом, если выполнил задание."
                )
            },
            {
                (12, 18),
                new Adventure(
                    new DateTimeOffset(2025, 12, 18, 0, 0, 0, TimeSpan.Zero),
                    "🎯 Задание на сегодня",
                    "На ёлках в офисе приготовлены небольшие подарки, нужно найти один и скинуть фотоотчет, подарок забираем себе.🎁"
                )
            },
            {
                (12, 19),
                new Adventure(
                    new DateTimeOffset(2025, 12, 19, 0, 0, 0, TimeSpan.Zero),
                    "✨ Твое приключение",
                    "Поделись топ 3 подарков на НГ, вдруг у кого-то нет идей, а ты ему очень поможешь. Машины, пароходы, самолеты, всё-всё кидайте.😁"
                )
            },
            {
                (12, 20),
                new Adventure(
                    new DateTimeOffset(2025, 12, 20, 0, 0, 0, TimeSpan.Zero),
                    "🎄 Новогоднее задание",
                    "Найди и сфотографируй гирлянду в окне. Своё окно тоже можно фоткать.🥰"
                )
            },
            {
                (12, 21),
                new Adventure(
                    new DateTimeOffset(2025, 12, 21, 0, 0, 0, TimeSpan.Zero),
                    "🌟 Сегодняшний квест",
                    "Одно хорошее дело нужно сегодня сделать. Любое! Доброе! Фотоотчеты не нужны. Баллы сегодня начислим всем.💙"
                )
            },
            {
                (12, 22),
                new Adventure(
                    new DateTimeOffset(2025, 12, 22, 0, 0, 0, TimeSpan.Zero),
                    "🎁 Задание дня",
                    "Селфи с питомцем сегодня выкладываем. У кого нет питомца, приходите в 211 кабинет к HR. Для фотосессии доступны коты, жираф и удав.🦒"
                )
            },
            {
                (12, 23),
                new Adventure(
                    new DateTimeOffset(2025, 12, 23, 0, 0, 0, TimeSpan.Zero),
                    "❄️ Зимнее приключение",
                    "Мастерим новогоднюю открытку своими руками. Просто белый сложенный лист не считается.😐"
                )
            },
            {
                (12, 24),
                new Adventure(
                    new DateTimeOffset(2025, 12, 24, 0, 0, 0, TimeSpan.Zero),
                    "🎊 Твоя миссия",
                    $"Пусть ваш следующий год будет ярким, радостным и счастливым!{Environment.NewLine}С любовью, команда HR-tech🎄✨"
                )
            }
        };

        _adventures = adventures;
    }

    /// <summary>
    /// Gets the adventure for a specific date.
    /// </summary>
    /// <param name="searchDate">The date to look up. The year and time component will be ignored.</param>
    /// <returns>The adventure for the given date, or null if none is found.</returns>
    public Adventure? GetAdventureForDate( DateTimeOffset searchDate )
    {
        (int Month, int Day) key = (searchDate.Month, searchDate.Day);

        if ( _adventures.TryGetValue( key, out Adventure? adventure ) )
        {
            return adventure;
        }

        return null;
    }
}

